Reports/СверкаРасчетовСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>СверкаРасчетовСКонтрагентами</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВключатьОбособленныеПодразделения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмещениеДополнительныхПолей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьОтчетПриИзмененииНастроек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группировка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипГруппировки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предопределенная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Использование</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предопределенная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/СверкаРасчетовСКонтрагентами/Forms/ФормаОтчета/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СервисСверкиРасчетовПереопределяемый.ОтчетПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	СервисСверкиРасчетовПереопределяемый.ЗаполнитьСписокОрганизаций(Элементы.ПолеОрганизация, СоответствиеОрганизаций);
	
	РежимРасшифровки          = Параметры.РежимРасшифровки;
	ИдентификаторыРасхождений = Параметры.ИдентификаторыРасхождений;
	
	// Отчет всегда открываем за предыдущий месяц.
	Отчет.НачалоПериода = НачалоМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), - 1));
	Отчет.КонецПериода  = КонецМесяца(ДобавитьМесяц(ТекущаяДатаСеанса(), - 1));

	Если РежимРасшифровки Тогда
		СтандартнаяОбработка = Ложь;
		// Когда в базе только одна организация, то значение всегда заполнено по-умолчанию, не перезаполняем.
		Если ИспользуетсяНесколькоОрганизаций Тогда
			Отчет.Организация   = Параметры.Организация;
		КонецЕсли;
		Отчет.Контрагент    = Параметры.Контрагент;
		Если ЗначениеЗаполнено(Параметры.НачалоПериода) Тогда
			Отчет.НачалоПериода = Параметры.НачалоПериода;
		Иначе
			КоличествоМесяцевКвартала = 3;
			Отчет.НачалоПериода = НачалоКвартала(ДобавитьМесяц(ТекущаяДатаСеанса(), - КоличествоМесяцевКвартала));
		КонецЕсли;
		Если ЗначениеЗаполнено(Параметры.КонецПериода) Тогда
			Отчет.КонецПериода = Параметры.КонецПериода;
		Иначе
			Отчет.КонецПериода = КонецМесяца(ТекущаяДатаСеанса());
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьДатуПолученияДанных(Ложь);
	Отчет.ФормироватьОтчетПриИзмененииНастроек = Истина;
	
	ПоказыватьСверенные   = Истина;
	ПоказыватьНесверенные = Ложь;
	ВариантОтчета = "Сверенные";
	
	НастроитьСовместимостьИнтерфейсов();
	
	ПоказатьБаннерВключитьОповещения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СервисСверкиРасчетовКлиентПереопределяемый.ПриОткрытии(ЭтотОбъект, Отказ);
	
	ОбновитьТекстЗаголовка(ЭтотОбъект);
	
	ФормироватьПослеУстановкиЗначений = РежимРасшифровки
		ИЛИ (ЗначениеЗаполнено(Отчет.Организация) И ЗначениеЗаполнено(Отчет.НачалоПериода) И ЗначениеЗаполнено(Отчет.КонецПериода));
	
	Если ФормироватьПослеУстановкиЗначений Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
	КонецЕсли;
	// Отчет открываем с отбором по критичным расхождениями или по критичным и незначительным,
	// если он открывается в режиме расшифровки.
	УстановитьОтборРасхождений(Истина, РежимРасшифровки,,,ФормироватьПослеУстановкиЗначений);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбсужденияПодключены" Тогда
		ОповещенияСверкиВключены = СервисСверкиРасчетовВызовСервера.ВключитьОповещениеСверки();
		Если ОповещенияСверкиВключены Тогда 
			ПоказатьБаннерВключитьОповещения();
		КонецЕсли;
	ИначеЕсли ИмяСобытия = "ПолучениеНовыхРасхожденийПоОрганизации" Тогда
		Если ИдетПолучениеРасхождений
			И Параметр.Организация = Отчет.Организация
			И (Параметр.КонецПериода >= Отчет.НачалоПериода И Параметр.НачалоПериода <= Отчет.КонецПериода)
			И ЭтотОбъект.ДатаПолученияДанныхСервисаСверкиРасчетов < Параметр.ВремяПолученияРасхождений Тогда
			ПослеЗавершенияОбмена();
		КонецЕсли;
	КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	ЗапуститьФормированиеОтчета();
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.Результат;
	Элементы.Результат.АктивизироватьПоУмолчанию = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", Отчет.НачалоПериода, Отчет.КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	СервисСверкиРасчетовКлиентПереопределяемый.ОткрытьФормуВыбораПериода(ПараметрыВыбора, Элементы.ВыбратьПериод, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьОповещения(Команда)

	Если НЕ СервисСверкиРасчетовВызовСервера.ОбсужденияПодключены() Тогда
		МодульОбсужденияКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ОбсужденияКлиент");
		МодульОбсужденияКлиент.ПоказатьПодключение();
	Иначе 
		ОповещенияСверкиВключены = СервисСверкиРасчетовВызовСервера.ВключитьОповещениеСверки();
		Если ОповещенияСверкиВключены Тогда
			ПоказатьБаннерВключитьОповещения();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НеВключатьОповещения(Команда)
	
	СкрытьБаннерВключитьОповещения();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменятьсяССервисом(Команда)
	
	ИдетПолучениеРасхождений = Истина;
	УправлениеФормой(ЭтотОбъект);
	
	ПодключитьОбработчикОжидания("ОбновитьДанныеОтчета", 1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеОрганизацияПриИзменении(Элемент)

	ОчиститьИтоги();
	
	СервисСверкиРасчетовКлиентПереопределяемый.ПолеОрганизацияПриИзменении(Элемент, ПолеОрганизация,
		Отчет.Организация, Отчет.ВключатьОбособленныеПодразделения);
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
	СервисСверкиРасчетовКлиентПереопределяемый.ОрганизацияПриИзменении(ЭтотОбъект, Элемент);
	
	Если ЗначениеЗаполнено(ИдентификаторЗаданияОбмена) Тогда
		ОтменитьВыполнениеЗаданияОбмена();
	КонецЕсли;
	
	ИдетПолучениеРасхождений = Ложь;
	ОтключитьОбработчикОжидания("ПроверитьЗавершенияОбмена");
	ОбновитьДатуПолученияДанных(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолеОрганизацияОткрытие(Элемент, СтандартнаяОбработка)
	
	СервисСверкиРасчетовКлиентПереопределяемый.ПолеОрганизацияОткрытие(Элемент, СтандартнаяОбработка,
		ПолеОрганизация, СоответствиеОрганизаций);
		
КонецПроцедуры

&НаКлиенте
Процедура ПолеОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СервисСверкиРасчетовКлиентПереопределяемый.ПолеОрганизацияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка, 
		СоответствиеОрганизаций, Отчет.Организация, Отчет.ВключатьОбособленныеПодразделения);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ОчиститьИтоги();
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)

	ОчиститьИтоги();
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЗаданияОбмена) Тогда
		ОтменитьВыполнениеЗаданияОбмена();
	КонецЕсли;
	
	ОбновитьТекстЗаголовка(ЭтотОбъект);
	
	ИдетПолучениеРасхождений = Ложь;
	ОтключитьОбработчикОжидания("ПроверитьЗавершенияОбмена");
	ОбновитьДатуПолученияДанных(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ОчиститьИтоги();
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЗаданияОбмена) Тогда
		ОтменитьВыполнениеЗаданияОбмена();
	КонецЕсли;
	
	ОбновитьТекстЗаголовка(ЭтотОбъект);
	
	ИдетПолучениеРасхождений = Ложь;
	ОтключитьОбработчикОжидания("ПроверитьЗавершенияОбмена");
	ОбновитьДатуПолученияДанных(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьОтборНовыеРасхожденияНажатие(Элемент)
	
	ИдентификаторыРасхождений.Очистить();
	Элементы.ГруппаОтборНовыеРасхождения.Видимость = Ложь;
	Если ЗначениеЗаполнено (Отчет.Организация)
		И ЗначениеЗаполнено(Отчет.НачалоПериода)
		И ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
		ПодключитьОбработчикОжидания("ЗапуститьФормированиеОтчета", 1, Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;

	Элементы.Результат.АктивизироватьПоУмолчанию = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПоляРезультата

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	СервисСверкиРасчетовКлиентПереопределяемый.ОбработкаРасшифровкиСтандартногоОтчета(ЭтотОбъект, Элемент, Расшифровка, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	// Не будем обрабатывать нажатие на правую кнопку мыши.
	// Покажем стандартное контекстное меню ячейки табличного документа.
	Расшифровка = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Форма.ИдетПолучениеРасхождений Тогда 
		Элементы.Обновить.Доступность  = Ложь;
		Элементы.Обновить.Картинка     = БиблиотекаКартинок.СинхронизацияДанныхДлительнаяОперация; 
		
		Элементы.Настройки.Доступность = Ложь;
	Иначе
		Элементы.Обновить.Доступность  = Истина;
		Элементы.Обновить.Картинка     = БиблиотекаКартинок.СинхронизацияДанных;
		
		Элементы.Настройки.Доступность = Истина;
	КонецЕсли;
	
	Элементы.ГруппаСверено.Видимость   = Форма.ПоказыватьСверенные;
	Элементы.ГруппаНеСверено.Видимость = Форма.ПоказыватьНесверенные;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеОтчета()
	
	// Проверим не получены ли более свежие данные в другом сеансе.
	// Если получены, то не генерируем новый обмен.
	ДатаАктуальностиДО = ДатаПолученияДанныхСервисаСверкиРасчетов;
	ОбновитьДатуПолученияДанных(Ложь);
	Если ДатаАктуальностиДО < ДатаПолученияДанныхСервисаСверкиРасчетов Тогда
		ПослеЗавершенияОбмена();
		Возврат;
	КонецЕсли;
	
	ОбменССервисом = ОбменятьсяДаннымиССервисом();
	Если ОбменССервисом.Свойство("ОтказПроверкиЗаполнения")
		И ОбменССервисом.ОтказПроверкиЗаполнения Тогда
		// Необходимо заполнить обязательные для обмена поля.
		ИдетПолучениеРасхождений = Ложь;
		УправлениеФормой(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	ИдентификаторЗаданияОбмена = ОбменССервисом.ИдентификаторЗадания;
	Если ОбменССервисом.Статус = "Выполнено" Тогда
		ПослеЗавершенияОбмена(ОбменССервисом);
		Возврат
	КонецЕсли;
	
	ОповещениеОЗавершении   = Новый ОписаниеОповещения("ПослеЗавершенияОбмена", ЭтотОбъект);
	ПараметрыОжидания       = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтаФорма);
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ОбменССервисом, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция ОбменятьсяДаннымиССервисом()
	
	ЭтоФормированиеОтчета = Ложь;
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат Новый Структура("ОтказПроверкиЗаполнения", Истина);
	КонецЕсли;
	
	НаименованиеЗадания = СтрШаблон("%1. Обмен с сервисом", СервисСверкиРасчетов.ИмяСервиса());
	ИмяМетода           = "СервисСверкиРасчетов.ОбменятьсяССервисом";
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыПроцедуры = Новый Структура("ЭтоВызовИзОтчета, Организация, НачальнаяДатаПолученияРасхождений, КонечнаяДатаПолученияРасхождений",
		Истина, Отчет.Организация, Отчет.НачалоПериода, Отчет.КонецПериода);
	
	Возврат ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, ИмяМетода, ПараметрыПроцедуры);
	
КонецФункции

&НаКлиенте
Процедура ПослеЗавершенияОбмена(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	ОтключитьОбработчикОжидания("ПроверитьЗавершенияОбмена");
	
	Если Не ИдетПолучениеРасхождений Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат <> Неопределено Тогда
		Если Результат.Статус <> "Выполнено" Тогда
			Возврат;
		Иначе
			Если ЗначениеЗаполнено(ИдентификаторЗаданияОбмена) Тогда
				ИдентификаторЗаданияОбмена = Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьДатуПолученияДанных();
	
	Если ИдетПолучениеРасхождений Тогда
		ПодключитьОбработчикОжидания("ПроверитьЗавершенияОбмена", 60, Истина);
		Возврат;
	КонецЕсли;
	
	Элементы.Результат.ОтображениеСостояния.Видимость                      = Истина;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.Неактуальность;
	Элементы.Результат.ОтображениеСостояния.Картинка                       = БиблиотекаКартинок.ДлительнаяОперация48;
	Элементы.Результат.ОтображениеСостояния.Текст                          = НСтр("ru = 'Получены новые данные из сервиса 1С:Сверка 2.0. Формируется актуальный отчет...'");
	
	ЭтоФормированиеПослеПолученияРасхождений = Истина;
	ПодключитьОбработчикОжидания("ЗапуститьФормированиеОтчета", 3, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьЗавершенияОбмена() Экспорт
	
	Если ИдетПолучениеРасхождений Тогда
		ПослеЗавершенияОбмена();
	Иначе
		ОтключитьОбработчикОжидания("ПроверитьЗавершенияОбмена");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПризнакПолученияРасхождений()
	
	ИдетПолучениеРасхождений = Ложь;
	
	Если Не ЗначениеЗаполнено(Отчет.Организация)
		ИЛИ Не ЗначениеЗаполнено(Отчет.НачалоПериода)
		ИЛИ Не ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим не получаются ли расхождения в других сеансах.
	ЗаблокированныеМесяца =
		РегистрыСведений.СервисСверкиРасчетовОчередьЗапросов.ЗаблокированныеМесяцаДляПолученияРасхождений(
		Отчет.Организация, Отчет.НачалоПериода, Отчет.КонецПериода);
	
	ИдетПолучениеРасхождений = ЗаблокированныеМесяца.Количество() > 0;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДатуПолученияДанных(ОбновлятьПризнакПолученияРасхождений = Истина)
	
	ДатаПолученияДанныхСервисаСверкиРасчетов = 
		РегистрыСведений.СервисСверкиРасчетовОчередьЗапросов.ДатаАктуальностиРасхождений(
		Отчет.Организация, Отчет.НачалоПериода, Отчет.КонецПериода);
		
	Если ОбновлятьПризнакПолученияРасхождений Тогда
		УстановитьПризнакПолученияРасхождений();
	КонецЕсли;
	
	Если Не ИдетПолучениеРасхождений Тогда // не меняем дату актуальности на форме в процессе обмена
		Если ЗначениеЗаполнено(ДатаПолученияДанныхСервисаСверкиРасчетов) Тогда
			ЧастиСообщения = Новый Массив;
			ЧастиСообщения.Добавить(НСтр("ru='Сверка актуальна на '"));
			ЧастиСообщения.Добавить(Новый ФорматированнаяСтрока(Строка(ДатаПолученияДанныхСервисаСверкиРасчетов), Новый Шрифт(Новый Шрифт,,,Истина)));
			ИтоговоеСообщение = Новый ФорматированнаяСтрока(ЧастиСообщения);
			Элементы.НадписьДатаАктуальности.Заголовок = ИтоговоеСообщение;
		Иначе
			Элементы.НадписьДатаАктуальности.Заголовок = НСтр("ru='Данные для отчета не получались'");
		КонецЕсли;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПодготовленныеДанные(РезультатВыполнения, ДополнительныеПараметры) Экспорт

	ЗагрузитьПодготовленныеДанныеНаСервере(РезультатВыполнения);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанныеНаСервере(РезультатВыполнения)

	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(РезультатВыполнения, "Статус", "Отменено") = "Отменено" Тогда
		
		ЭтотОбъект.Результат = Новый ТабличныйДокумент;
		ЭтотОбъект.ДанныеРасшифровки = Неопределено;
		// ОписаниеЗаданияФормированияОтчета не очищаем на случай, если отмена произошла перед началом нового формирования отчета,
		// и описание уже относится к новому запуску.
		Возврат;
		
	ИначеЕсли РезультатВыполнения.Статус = "Ошибка" Тогда
		// Это результат аварийного завершения фонового задания.
		ОбщегоНазначения.СообщитьПользователю(РезультатВыполнения.КраткоеПредставлениеОшибки);
		
		ЭтотОбъект.Результат = Новый ТабличныйДокумент;
		ЭтотОбъект.ДанныеРасшифровки = Неопределено;
		
		ПозицияТочки = СтрНайти(ЭтотОбъект.ИмяФормы, ".", ,, 2);
		ПолноеИмяМетаданного = ?(ПозицияТочки = 0, ЭтотОбъект.ИмяФормы, Лев(ЭтотОбъект.ИмяФормы, ПозицияТочки - 1));
		ОтчетМетаданные = Метаданные.НайтиПоПолномуИмени(ПолноеИмяМетаданного);
		ОтчетОрганизация = ?(ЭтотОбъект.Отчет.Свойство("Организация"), ЭтотОбъект.Отчет.Организация, Неопределено);
		
		ЗаписьЖурналаРегистрации("ОшибкаФормированияОтчета",
			УровеньЖурналаРегистрации.Ошибка,
			ОтчетМетаданные,
			ОтчетОрганизация,
			РезультатВыполнения.ПодробноеПредставлениеОшибки,
			РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
		
		Возврат;
		
	КонецЕсли;
	
	ЭтотОбъект.ОписаниеЗаданияФормированияОтчета = Неопределено;
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтотОбъект.Элементы.Результат, "НеИспользовать");
	
	ДанныеОтчета = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
	УдалитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
	Если ДанныеОтчета = Неопределено Или Не ДанныеОтчета.Свойство("Результат") Тогда
		// Некорректный результат формирования отчета.
		ЭтотОбъект.Результат = Новый ТабличныйДокумент;
		ЭтотОбъект.ДанныеРасшифровки = Неопределено;
		
		ПозицияТочки = СтрНайти(ЭтотОбъект.ИмяФормы, ".", ,, 2);
		ПолноеИмяМетаданного = ?(ПозицияТочки = 0, ЭтотОбъект.ИмяФормы, Лев(ЭтотОбъект.ИмяФормы, ПозицияТочки - 1));
		ОтчетМетаданные = Метаданные.НайтиПоПолномуИмени(ПолноеИмяМетаданного);
		ОтчетОрганизация = ?(ЭтотОбъект.Отчет.Свойство("Организация"), ЭтотОбъект.Отчет.Организация, Неопределено);
		
		ЗаписьЖурналаРегистрации("ОшибкаФормированияОтчета",
			УровеньЖурналаРегистрации.Ошибка,
			ОтчетМетаданные,
			ОтчетОрганизация,
			НСтр("ru = 'Некорректный результат формирования отчета: отсутствует Результат'"),
			РежимТранзакцииЗаписиЖурналаРегистрации.Независимая);
			
		Возврат;
		
	КонецЕсли;
		
	ЭтотОбъект.Результат                    = ДанныеОтчета.Результат;
	ЭтотОбъект.Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ДанныеОтчета.Результат = Неопределено;
	ЭтотОбъект.ДанныеРасшифровки = ДанныеОтчета.ДанныеРасшифровки;
	ДанныеОтчета.ДанныеРасшифровки = Неопределено;
	
	ИтогиСверки = ДанныеОтчета.ИтогиСверки;
	КоличествоСверяемых      = ИтогиСверки.ВсегоДокументов;
	КоличествоСверено        = ИтогиСверки.Сверено;
	КоличествоНеСверено      = ИтогиСверки.НеСверено;
	КоличествоКритичных      = ИтогиСверки.Критичные;
	КоличествоНезначительных = ИтогиСверки.Незначительные;
	КоличествоБезРасхождений = ИтогиСверки.БезРасхождений;
	
	// Если сверенных документов больше 1000, то не формируем автоматически отчет после снятия флажков.
	МаксимальноеКоличествоДокументовДляАвтоформирования = 1000;
	Отчет.ФормироватьОтчетПриИзмененииНастроек = КоличествоСверено <= МаксимальноеКоличествоДокументовДляАвтоформирования;
	
	ОтобразитьИтоги();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьБаннерВключитьОповещения()

	НеПоказыватьПредложениеПодключитьОповещения = ХранилищеОбщихНастроек.Загрузить(ВРег("СервисСверкиРасчетовНеПоказыватьПредложениеПодключитьОповещения"));
	ПолныеПраваИлиПривилегированныйРежим = Пользователи.ЭтоПолноправныйПользователь();
	Если ЗначениеЗаполнено(НеПоказыватьПредложениеПодключитьОповещения) Тогда
		Элементы.ГруппаВключениеОповещений.Видимость = ПолныеПраваИлиПривилегированныйРежим
		И Не СервисСверкиРасчетовВызовСервера.ОповещенияСверкиВключены()
		И Не НеПоказыватьПредложениеПодключитьОповещения
		И ВариантОтчета = "Сверенные";
	Иначе
		Элементы.ГруппаВключениеОповещений.Видимость = ПолныеПраваИлиПривилегированныйРежим
			И Не СервисСверкиРасчетовВызовСервера.ОповещенияСверкиВключены()
			И ВариантОтчета = "Сверенные";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкрытьБаннерВключитьОповещения()
	
	ХранилищеОбщихНастроек.Сохранить(ВРег("СервисСверкиРасчетовНеПоказыватьПредложениеПодключитьОповещения"),, Истина);
	Элементы.ГруппаВключениеОповещений.Видимость = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьИтоги()
	
	Отчет.ФормироватьОтчетПриИзмененииНастроек = Ложь;
	
	КоличествоСверяемых      = 0;
	КоличествоСверено        = 0;
	КоличествоНеСверено      = 0;
	КоличествоКритичных      = 0;
	КоличествоНезначительных = 0;
	КоличествоБезРасхождений = 0;
	
	ОтобразитьИтоги();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьИтоги()
	
	Элементы.ДекорацияСостояниеСверки.Заголовок = СтрШаблон(НСтр("ru='Документы к сверке %1'"),?(КоличествоСверяемых = 0, "", "(" + КоличествоСверяемых +")"));
	Элементы.ВариантОтчета.СписокВыбора.Получить(0).Представление = СтрШаблон(НСтр("ru='Сверялось %1'"),?(КоличествоСверено = 0, "", "(" + КоличествоСверено +")"));
	Элементы.ВариантОтчета.СписокВыбора.Получить(1).Представление = СтрШаблон(НСтр("ru='Не сверялось %1'"),?(КоличествоНеСверено = 0, "", "(" + КоличествоНеСверено +")"));
	
	Элементы.ПоказыватьКритичные.Заголовок      = СтрШаблон(НСтр("ru='Критичные расхождения %1'"), ?(КоличествоКритичных = 0, "", "(" + КоличествоКритичных +")"));
	Элементы.ПоказыватьНезначительные.Заголовок = СтрШаблон(НСтр("ru='Незначительные расхождения %1'"), ?(КоличествоНезначительных = 0, "", "(" + КоличествоНезначительных +")"));
	Элементы.ПоказыватьБезРасхождений.Заголовок = СтрШаблон(НСтр("ru='Без расхождений %1'"), ?(КоличествоБезРасхождений = 0, "", "(" + КоличествоБезРасхождений +")"));
	
	Если ИдентификаторыРасхождений.Количество() > 0 Тогда
		Элементы.ГруппаОтборНовыеРасхождения.Видимость = Истина;
	Иначе
		Элементы.ГруппаОтборНовыеРасхождения.Видимость = Ложь;
	КонецЕсли;
	
	НастроитьДиаграммы();

КонецПроцедуры

&НаСервере
Процедура НастроитьДиаграммы()
	
	ТаблицаСтатусов = Новый ТаблицаЗначений;
	ТаблицаСтатусов.Колонки.Добавить("ИмяПараметра");
	ТаблицаСтатусов.Колонки.Добавить("ЗначениеПараметра");
	
	Если ПоказыватьСверенные Тогда
		
		НоваяСтрока                   = ТаблицаСтатусов.Добавить();
		НоваяСтрока.ИмяПараметра      = НСтр("ru='Критичные расхождения'");
		НоваяСтрока.ЗначениеПараметра = КоличествоКритичных;
		
		НоваяСтрока                   = ТаблицаСтатусов.Добавить();
		НоваяСтрока.ИмяПараметра      = НСтр("ru='Незначительные расхождения'");
		НоваяСтрока.ЗначениеПараметра = КоличествоНезначительных;
		
		НоваяСтрока                   = ТаблицаСтатусов.Добавить();
		НоваяСтрока.ИмяПараметра      = НСтр("ru='Без расхождений'");
		НоваяСтрока.ЗначениеПараметра = КоличествоБезРасхождений;
		
		СостояниеСверки.ИсточникДанных = ТаблицаСтатусов;
		Если ЭтоИнтерфейсТакси Тогда
			СостояниеСверки.Серии.Получить(0).Цвет = ЦветаСтиля.ЦветКритичныеРасхожденияТакси;
			СостояниеСверки.Серии.Получить(1).Цвет = ЦветаСтиля.ЦветНезначительныеРасхожденияТакси;
			СостояниеСверки.Серии.Получить(2).Цвет = ЦветаСтиля.ЦветБезРасхожденийТакси;
		Иначе
			СостояниеСверки.Серии.Получить(0).Цвет = ЦветаСтиля.ЦветКритичныеРасхождения;
			СостояниеСверки.Серии.Получить(1).Цвет = ЦветаСтиля.ЦветНезначительныеРасхождения;
			СостояниеСверки.Серии.Получить(2).Цвет = ЦветаСтиля.ЦветБезРасхождений;
			
		КонецЕсли;
		СостояниеСверки.ВидПодписей = ВидПодписейКДиаграмме.ЗначениеПроцент;
		
		ПоказатьВсе = РасхожденияВСуммах
		И РасхожденияСчетовФактур
		И ОтсутствуетДокумент
		И КонтрагентНеУчитываетНДС
		И РасхожденияПервичныхДокументов
		И ПоказыватьБезРасхождений;
		Элементы.СостояниеСверки.Видимость = ПоказатьВсе;
		
	Иначе
		
		НоваяСтрока                   = ТаблицаСтатусов.Добавить();
		НоваяСтрока.ИмяПараметра      = НСтр("ru='Сверялось'");
		НоваяСтрока.ЗначениеПараметра = КоличествоСверено;
		
		НоваяСтрока                   = ТаблицаСтатусов.Добавить();
		НоваяСтрока.ИмяПараметра      = НСтр("ru='Не сверялось'");
		НоваяСтрока.ЗначениеПараметра = КоличествоНеСверено;
		
		СостояниеСверки.ИсточникДанных = ТаблицаСтатусов;
		Если ЭтоИнтерфейсТакси Тогда
			СостояниеСверки.Серии.Получить(0).Цвет = ЦветаСтиля.ЦветСверялосьТакси;
			СостояниеСверки.Серии.Получить(1).Цвет = ЦветаСтиля.ЦветНеСверялосьТакси;
		Иначе
			СостояниеСверки.Серии.Получить(0).Цвет = ЦветаСтиля.ЦветСверялось;
			СостояниеСверки.Серии.Получить(1).Цвет = ЦветаСтиля.ЦветНеСверялось;
		КонецЕсли;
		СостояниеСверки.ВидПодписей = ВидПодписейКДиаграмме.СерияПроцент;
		Элементы.СостояниеСверки.Видимость = Истина;
		
	КонецЕсли;
	СостояниеСверки.Обновление = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьФормированиеОтчета()
	
	ОчиститьСообщения();
	ОтказПроверкиЗаполнения = Ложь;
	
	ИдетПолучениеРасхождений = Ложь;
	ОтключитьОбработчикОжидания("ПроверитьЗавершенияОбмена");
	
	РезультатВыполнения = СформироватьОтчетНаСервере();
	Если РезультатВыполнения.Свойство("ОтказПроверкиЗаполнения") Тогда
		ОтказПроверкиЗаполнения = РезультатВыполнения.ОтказПроверкиЗаполнения;
	КонецЕсли;
	
	Если НЕ ОтказПроверкиЗаполнения Тогда
		
		Если РезультатВыполнения.Статус = "Выполняется"
			И Не ЭтоФормированиеПослеПолученияРасхождений Тогда 
			ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "ФормированиеОтчета");
		КонецЕсли;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьПодготовленныеДанные", ЭтотОбъект);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
		
	КонецЕсли;
	
	ЭтоФормированиеПослеПолученияРасхождений = Ложь;
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетНаСервере() Экспорт
	
	ОбновитьДатуПолученияДанных(Ложь);
	
	Если Не КомпоновщикИнициализирован Тогда
		ИнициализироватьКомпоновщикаНастроек();
	КонецЕсли;
	
	ЭтоФормированиеОтчета = Истина;
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат Новый Структура("ЗаданиеВыполнено, ОтказПроверкиЗаполнения", Истина, Истина);
	КонецЕсли;
	
	Если ЭтотОбъект.ОписаниеЗаданияФормированияОтчета <> Неопределено Тогда
		
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ЭтотОбъект.ОписаниеЗаданияФормированияОтчета.ИдентификаторЗадания);
		ЭтотОбъект.ОписаниеЗаданияФормированияОтчета = Неопределено;
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	Настройки.Отбор.ИдентификаторПользовательскойНастройки              = "";
	Настройки.Порядок.ИдентификаторПользовательскойНастройки            = "";
	Настройки.УсловноеОформление.ИдентификаторПользовательскойНастройки = "";
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьЗаголовок", ВыводитьЗаголовок);
	Настройки.ДополнительныеСвойства.Вставить("ВыводитьПодвал"   , ВыводитьПодвал);
	
	ПараметрыОтчета = ПодготовитьПараметрыОтчетаНаСервере();
	
	ОписаниеЗаданияФормированияОтчета = ЗапуститьПодготовкуОтчета(ЭтотОбъект, ПараметрыОтчета);
	
	Элементы.Сформировать.КнопкаПоУмолчанию = Истина;
	
	Возврат ОписаниеЗаданияФормированияОтчета;
	
КонецФункции

&НаСервере
Функция ЗапуститьПодготовкуОтчета(Форма, ПараметрыОтчета)
	
	ПараметрыЗадания = ДлительныеОперации.ПараметрыВыполненияФункции(Форма.УникальныйИдентификатор);
	
	НаименованиеЗадания = НСтр("ru = 'Выполнение отчета: %1'");
	ИмяОтчета = "СверкаРасчетовСКонтрагентами";
	
	ПараметрыЗадания.НаименованиеФоновогоЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НаименованиеЗадания, ИмяОтчета);
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ПараметрыЗадания.ЗапуститьНеВФоне = Истина;
	КонецЕсли;
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыЗадания, "СервисСверкиРасчетовВызовСервера.ПодготовитьОтчет", ПараметрыОтчета);
	
КонецФункции

&НаСервере
Функция ПодготовитьПараметрыОтчетаНаСервере()
	
	МенеджерОтчета = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ЭтотОбъект.ИмяФормы);
	
	ПараметрыОтчета = МенеджерОтчета.ПустыеПараметрыКомпоновкиОтчета();
	
	ПараметрыОтчета.Организация                       = Отчет.Организация;
	ПараметрыОтчета.ВключатьОбособленныеПодразделения = Отчет.ВключатьОбособленныеПодразделения;
	ПараметрыОтчета.Контрагент                        = Отчет.Контрагент;
	ПараметрыОтчета.НачалоПериода                     = Отчет.НачалоПериода;
	ПараметрыОтчета.КонецПериода                      = Отчет.КонецПериода;
	ПараметрыОтчета.СхемаКомпоновкиДанных             = ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных);
	ПараметрыОтчета.ИдентификаторОтчета               = "СверкаРасчетовСКонтрагентами";
	ПараметрыОтчета.ДанныеРасшифровки                 = ДанныеРасшифровки;
	ПараметрыОтчета.НастройкиКомпоновкиДанных         = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	ПараметрыОтчета.ОтборОтличаетсяСумма              = РасхожденияВСуммах;
	ПараметрыОтчета.ОтборОтличаетсяСФ                 = РасхожденияСчетовФактур;
	ПараметрыОтчета.ОтборОтсутствуетДокумент          = ОтсутствуетДокумент;
	ПараметрыОтчета.ОтборКонтрагентНеУчитываетНДС     = КонтрагентНеУчитываетНДС;
	ПараметрыОтчета.ОтборОтличаетсяПервичныйДокумент  = РасхожденияПервичныхДокументов;
	ПараметрыОтчета.ОтборБезРасхождений               = ПоказыватьБезРасхождений;
	ПараметрыОтчета.ОтборНеСверено                    = ПоказыватьНесверенные;
	ПараметрыОтчета.ИнтерфейсТакси                    = ЭтоИнтерфейсТакси;
	
	ПараметрыОтчета.ТребуетсяОтправкаДокументов   = ТребуетсяОтправкаДокументов;
	ПараметрыОтчета.ОжидаемДокументыОтКонтрагента = ОжидаемДокументыОтКонтрагента;
	ПараметрыОтчета.КонтрагентНеПодключенКСервису = КонтрагентНеПодключенКСервису;
	
	ПараметрыОтчета.Вставить("ВыводитьЗаголовок"        , Истина);
	ПараметрыОтчета.Вставить("ВыводитьПодвал"           , Ложь);
	ПараметрыОтчета.Вставить("ВыводитьОрганизацию"      , НЕ ЗначениеЗаполнено(Отчет.Организация));
	
	ПоказатьВсе = РасхожденияВСуммах
		И РасхожденияСчетовФактур
		И ОтсутствуетДокумент
		И КонтрагентНеУчитываетНДС
		И РасхожденияПервичныхДокументов
		И ПоказыватьБезРасхождений;
	ПараметрыОтчета.Вставить("ПоказатьВсе"      , ПоказатьВсе);
	
	Если ПоказыватьНесверенные Тогда
		Если ЗначениеЗаполнено(Отчет.Организация)
			И НЕ Отчет.ВключатьОбособленныеПодразделения Тогда 
			ПараметрыОтчета.Вставить("ИдентификаторМакета"      , "НесверенныеПоОрганизации");
		Иначе
			ПараметрыОтчета.Вставить("ИдентификаторМакета"      , "Несверенные");
		КонецЕсли;
	Иначе
		Если ПоказатьВсе Тогда
			ПараметрыОтчета.Вставить("ИдентификаторМакета"      , "СверенныеБезОтбора"); 
		Иначе
			ПараметрыОтчета.Вставить("ИдентификаторМакета"      , "СверенныеСОтбором"); 
		КонецЕсли;
	КонецЕсли;
	ПараметрыОтчета.Вставить("ИдентификаторыРасхождений", ИдентификаторыРасхождений);

	ПараметрыОтчета.Вставить("ДатаАктуальности",          ДатаПолученияДанныхСервисаСверкиРасчетов);
	
	Возврат ПараметрыОтчета;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьКомпоновщикаНастроек()
	
	ИмяОтчета = "СверкаРасчетовСКонтрагентами";
	
	Схема     = Отчеты.СверкаРасчетовСКонтрагентами.ПолучитьМакет("СхемаКомпоновкиДанных");
	Настройки = Схема.НастройкиПоУмолчанию;
	
	ЭтотОбъект.СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(Схема, ЭтотОбъект.УникальныйИдентификатор);
	
	Попытка
		ЭтотОбъект.Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ЭтотОбъект.СхемаКомпоновкиДанных));
	Исключение
		ИмяСобытияЖурнала = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Отчеты.%1'", ОбщегоНазначения.КодОсновногоЯзыка()),
		ИмяОтчета);
		
		ТекстПредставленияОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
		ИмяСобытияЖурнала,
		УровеньЖурналаРегистрации.Ошибка,
		,
		,
		ТекстПредставленияОшибки);
		ВызватьИсключение;
	КонецПопытки;
	
	ЭтотОбъект.Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьИтоги();
	
	ЗаполнитьЗначенияСвойств(Отчет, РезультатВыбора, "НачалоПериода,КонецПериода");
	
	Если ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИдентификаторЗаданияОбмена) Тогда
		ОтменитьВыполнениеЗаданияОбмена();
	КонецЕсли;
	
	ОбновитьТекстЗаголовка(ЭтотОбъект);
	
	ИдетПолучениеРасхождений = Ложь;
	ОтключитьОбработчикОжидания("ПроверитьЗавершенияОбмена");
	ОбновитьДатуПолученияДанных(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если НЕ ЗавершениеРаботы 
		И ЗначениеЗаполнено(ИдентификаторЗаданияОбмена) Тогда
		ОтменитьВыполнениеЗаданияОбмена();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьВыполнениеЗаданияОбмена()
	
	Если ЗначениеЗаполнено(ИдентификаторЗаданияОбмена) Тогда
		ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗаданияОбмена);
	КонецЕсли;
	
	ИдентификаторЗаданияОбмена = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ЗначениеЗаполнено(Отчет.НачалоПериода) И ЗначениеЗаполнено(Отчет.КонецПериода)
		И Отчет.НачалоПериода > Отчет.КонецПериода Тогда
		ТекстСообщения = НСтр("ru = 'Дата начала периода не может быть больше даты конца периода'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Отчет.НачалоПериода",, Отказ);
	КонецЕсли;
	
	Если ЭтоФормированиеОтчета Тогда
		// Прочие проверки нужны только для получения данных из сервиса.
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		ТекстСообщения = НСтр("ru = 'Для получения данных из сервиса укажите начало периода'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Отчет.НачалоПериода",, Отказ);
	ИначеЕсли Отчет.НачалоПериода > КонецМесяца(ТекущаяДатаСеанса()) Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='Получение данных из сервиса доступно за периоды до %1'"),
			Формат(КонецМесяца(ТекущаяДатаСеанса()), "ДЛФ=Д") );
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Отчет.НачалоПериода",, Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		ТекстСообщения = НСтр("ru = 'Для получения данных из сервиса укажите конец периода'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Отчет.КонецПериода",, Отказ);
	ИначеЕсли Отчет.КонецПериода < СервисСверкиРасчетов.ДатаНачалаСверкиРасчетов() Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='Получение данных из сервиса возможно с %1'"),
			Формат(СервисСверкиРасчетов.ДатаНачалаСверкиРасчетов(), "ДЛФ=Д") );
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Отчет.КонецПериода",, Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Отчет.Организация)Тогда
		ТекстСообщения = НСтр("ru = 'Для получения данных из сервиса укажите организацию'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "ПолеОрганизация", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборРасхождений(Критичные = Истина, Незначительные = Ложь, БезРасхождений = Ложь, НеСверено = Ложь, ФормироватьПослеУстановкиЗначений = Истина)
	
	РасхожденияВСуммах             = Критичные;
	РасхожденияСчетовФактур        = Критичные;
	ОтсутствуетДокумент            = Критичные;
	
	КонтрагентНеУчитываетНДС       = Незначительные;
	РасхожденияПервичныхДокументов = Незначительные;
	
	ПоказыватьБезРасхождений       = БезРасхождений;
	
	КонтрагентНеПодключенКСервису  = НеСверено;
	ТребуетсяОтправкаДокументов    = НеСверено;
	ОжидаемДокументыОтКонтрагента  = НеСверено;
	
	УстановитьЗначениеГруппРасхождений(ФормироватьПослеУстановкиЗначений);
	
КонецПроцедуры

&НаКлиенте
Процедура РасхожденияВСуммахПриИзменении(Элемент)
	
	Если РасхожденияВСуммах Тогда 
		СброситьНеКомплементарныеФлаги(Истина);
	КонецЕсли;
	УстановитьЗначениеГруппРасхождений();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗначениеГруппРасхождений(ФормироватьПослеУстановкиЗначений = Истина)
	
	ПоказыватьКритичные      = РасхожденияВСуммах ИЛИ РасхожденияСчетовФактур ИЛИ ОтсутствуетДокумент;
	ПоказыватьНезначительные = КонтрагентНеУчитываетНДС ИЛИ РасхожденияПервичныхДокументов;
	
	УправлениеФормой(ЭтотОбъект);
	
	Если ФормироватьПослеУстановкиЗначений
		И Отчет.ФормироватьОтчетПриИзмененииНастроек Тогда 
		ПодключитьОбработчикОжидания("ЗапуститьФормированиеОтчета", 0.1, Истина);
	ИначеЕсли ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьНеКомплементарныеФлаги(ЭтоСверенные)
	
	Если ЭтоСверенные Тогда
		// Сбрасываем флаги, соответствующие несверенным документам.
		КонтрагентНеПодключенКСервису = Ложь;
		ТребуетсяОтправкаДокументов   = Ложь;
		ОжидаемДокументыОтКонтрагента           = Ложь;
	Иначе
		// Сбрасываем флаги, соответствующие сверенным документам.
		ПоказыватьКритичные            = Ложь;
		РасхожденияВСуммах             = Ложь;
		РасхожденияСчетовФактур        = Ложь;
		ОтсутствуетДокумент            = Ложь;
		ПоказыватьНезначительные       = Ложь;
		КонтрагентНеУчитываетНДС       = Ложь;
		РасхожденияПервичныхДокументов = Ложь;
		ПоказыватьБезРасхождений       = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасхожденияСчетовФактурПриИзменении(Элемент)
	
	Если РасхожденияСчетовФактур Тогда 
		СброситьНеКомплементарныеФлаги(Истина);
	КонецЕсли;
	УстановитьЗначениеГруппРасхождений();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтсутствуетДокументПриИзменении(Элемент)
	
	Если ОтсутствуетДокумент Тогда 
		СброситьНеКомплементарныеФлаги(Истина);
	КонецЕсли;
	УстановитьЗначениеГруппРасхождений();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНеУчитываетНДСПриИзменении(Элемент)
	
	Если КонтрагентНеУчитываетНДС Тогда 
		СброситьНеКомплементарныеФлаги(Истина);
	КонецЕсли;
	УстановитьЗначениеГруппРасхождений();
	
КонецПроцедуры

&НаКлиенте
Процедура РасхожденияПервичныхДокументовПриИзменении(Элемент)
	
	Если РасхожденияПервичныхДокументов Тогда 
		СброситьНеКомплементарныеФлаги(Истина);
	КонецЕсли;
	УстановитьЗначениеГруппРасхождений();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентНеПодключенКСервисуПриИзменении(Элемент)
	
	Если КонтрагентНеПодключенКСервису Тогда
		СброситьНеКомплементарныеФлаги(Ложь);
	КонецЕсли;
	УстановитьЗначениеГруппРасхождений();
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяОтправкаДокументовПриИзменении(Элемент)
	
	Если ТребуетсяОтправкаДокументов Тогда
		СброситьНеКомплементарныеФлаги(Ложь);
	КонецЕсли;
	УстановитьЗначениеГруппРасхождений();
	
КонецПроцедуры

&НаКлиенте
Процедура ОжидаемДокументыОтКонтрагентаПриИзменении(Элемент)
	
	Если ОжидаемДокументыОтКонтрагента Тогда
		СброситьНеКомплементарныеФлаги(Ложь);
	КонецЕсли;
	УстановитьЗначениеГруппРасхождений();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтчетаПриИзменении(Элемент)
	
	Элементы.СостояниеСверки.Видимость = Ложь;;
	
	Если ВариантОтчета = "Сверенные" Тогда
		
		ПоказыватьСверенные   = Истина;
		ПоказыватьНесверенные = Ложь;
		
		СброситьНеКомплементарныеФлаги(Истина);
		
		// Восстанавливаем отбор по главным группам, подчиненные флаги всегда возводим.
		УстановитьОтборРасхождений(ПоказыватьКритичныеДО, ПоказыватьНезначительныеДО, ПоказыватьБезРасхожденийДО, Ложь);
		Элементы.Результат.ТекущаяОбласть = Результат.Область(1,1,1,1);
		
		ПоказатьБаннерВключитьОповещения();
	
	Иначе
		ПоказыватьСверенные   = Ложь;
		ПоказыватьНесверенные = Истина;
		
		ПоказыватьКритичныеДО      = ПоказыватьКритичные; 
		ПоказыватьНезначительныеДО = ПоказыватьНезначительные; 
		ПоказыватьБезРасхожденийДО = ПоказыватьБезРасхождений;
		
		СброситьНеКомплементарныеФлаги(Ложь);
		
		Элементы.УточнениеКритичных.Видимость = Ложь;
		Элементы.ПоказатьСкрытьРасшифровкуКритичных.Картинка  = БиблиотекаКартинок.СервисСверкиСдвинутьВниз;
		Элементы.ПоказатьСкрытьРасшифровкуКритичных.Подсказка = НСтр("ru = 'Показать'");
		
		Элементы.УточнениеНезначительных.Видимость = Ложь;
		Элементы.ПоказатьСкрытьРасшифровкуНезначительные.Картинка  = БиблиотекаКартинок.СервисСверкиСдвинутьВниз;
		Элементы.ПоказатьСкрытьРасшифровкуНезначительные.Подсказка = НСтр("ru = 'Показать'");
		
		УстановитьОтборРасхождений(Ложь, Ложь, Ложь, Истина); 
		Элементы.Результат.ТекущаяОбласть = Результат.Область(1,1,1,1);
		
		Элементы.ГруппаВключениеОповещений.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьНастройки(Команда)
	
	Если Элементы.Настройки.Видимость Тогда
		Элементы.Настройки.Видимость = Ложь;
		Элементы.ПоказатьСкрытьНастроки.Заголовок = НСтр("ru = '< Показать настройки'");
	Иначе
		Элементы.Настройки.Видимость = Истина;
		Элементы.ПоказатьСкрытьНастроки.Заголовок = НСтр("ru = '> Скрыть настройки'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяОтправкаДокументовРасширеннаяПодсказкаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если Строка(НавигационнаяСсылкаФорматированнойСтроки) = "ОправитьДокументыНаСверку"
		И Элементы.Настройки.Доступность Тогда
		ИдетПолучениеРасхождений = Истина;
		УправлениеФормой(ЭтотОбъект);
		ПодключитьОбработчикОжидания("ОбновитьДанныеОтчета", 1, Истина);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьКритичныеПриИзменении(Элемент)
	
	РасхожденияВСуммах             = ПоказыватьКритичные;
	РасхожденияСчетовФактур        = ПоказыватьКритичные;
	ОтсутствуетДокумент            = ПоказыватьКритичные;
	
	УправлениеФормой(ЭтотОбъект);
	
	Если Отчет.ФормироватьОтчетПриИзмененииНастроек Тогда 
		ПодключитьОбработчикОжидания("ЗапуститьФормированиеОтчета", 0.1, Истина);
	ИначеЕсли ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьНезначительныеПриИзменении(Элемент)
	
	КонтрагентНеУчитываетНДС       = ПоказыватьНезначительные;
	РасхожденияПервичныхДокументов = ПоказыватьНезначительные;
	
	УправлениеФормой(ЭтотОбъект);
	
	Если Отчет.ФормироватьОтчетПриИзмененииНастроек Тогда 
		ПодключитьОбработчикОжидания("ЗапуститьФормированиеОтчета", 0.1, Истина);
	ИначеЕсли ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьБезРасхожденийПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
	Если Отчет.ФормироватьОтчетПриИзмененииНастроек Тогда 
		ПодключитьОбработчикОжидания("ЗапуститьФормированиеОтчета", 0.1, Истина);
	ИначеЕсли ОписаниеЗаданияФормированияОтчета = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьРасшифровкуКритичныхНажатие(Элемент)
	
	Элементы.УточнениеКритичных.Видимость = НЕ Элементы.УточнениеКритичных.Видимость;
	
	Если Элементы.УточнениеКритичных.Видимость Тогда
		Элементы.ПоказатьСкрытьРасшифровкуКритичных.Картинка  = БиблиотекаКартинок.СервисСверкиСдвинутьВверх;
		Элементы.ПоказатьСкрытьРасшифровкуКритичных.Подсказка = НСтр("ru = 'Скрыть'");
	Иначе
		Элементы.ПоказатьСкрытьРасшифровкуКритичных.Картинка  = БиблиотекаКартинок.СервисСверкиСдвинутьВниз;
		Элементы.ПоказатьСкрытьРасшифровкуКритичных.Подсказка = НСтр("ru = 'Показать'");
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСкрытьРасшифровкуНезначительныеНажатие(Элемент)
	
	Элементы.УточнениеНезначительных.Видимость = НЕ Элементы.УточнениеНезначительных.Видимость;
	
	Если Элементы.УточнениеНезначительных.Видимость Тогда
		Элементы.ПоказатьСкрытьРасшифровкуНезначительные.Картинка  = БиблиотекаКартинок.СервисСверкиСдвинутьВверх;
		Элементы.ПоказатьСкрытьРасшифровкуНезначительные.Подсказка = НСтр("ru = 'Скрыть'");
	Иначе
		Элементы.ПоказатьСкрытьРасшифровкуНезначительные.Картинка  = БиблиотекаКартинок.СервисСверкиСдвинутьВниз;
		Элементы.ПоказатьСкрытьРасшифровкуНезначительные.Подсказка = НСтр("ru = 'Показать'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьСовместимостьИнтерфейсов()
	
	ЭтоИнтерфейсТакси = СервисСверкиРасчетов.ЭтоИнтерфейсТакси();
	
	Если ЭтоИнтерфейсТакси Тогда
		
		Элементы.Настройки.Ширина               = 31;
		Элементы.Контрагент.Ширина              = 25;
		Элементы.УточнениеКритичных.Ширина      = 28;
		Элементы.ФлагиКритичных.Ширина          = 23;
		Элементы.УточнениеНезначительных.Ширина = 28;
		Элементы.ФлагиНезначительных.Ширина     = 23;
		
	Иначе
		
		СистемнаяИнформация = Новый СистемнаяИнформация();
		ДоступенИнтерфейс85 = ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.5.1.1150") >= 0;
		Если ДоступенИнтерфейс85 Тогда
			Элементы.Настройки.Ширина               = 35;
			Элементы.Контрагент.Ширина              = 35;
			Элементы.УточнениеКритичных.Ширина      = 33;
			Элементы.ФлагиКритичных.Ширина          = 27;
			Элементы.УточнениеНезначительных.Ширина = 33;
			Элементы.ФлагиНезначительных.Ширина     = 27;
			Элементы.ВариантОтчета.РастягиватьПоГоризонтали = Истина;
			ЭтотОбъект.ВариантМасштаба = ВариантМасштабаФормКлиентскогоПриложения.Компактный;
			
			// Свойства доступны, начиная с платформы 8.5
			Выполнить("Элементы.Настройки.ОтображатьКакКарточку = Истина");
			Выполнить("Элементы.Обновить.Важность = ВажностьКнопки.Дополнительная"); 
			Выполнить("Элементы.ВариантОтчета.РастягиватьПоГоризонтали = Истина");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьТекстЗаголовка(Форма)
	
	Отчет = Форма.Отчет;
	
	ТекстПериод = "";
	Если ЗначениеЗаполнено(Отчет.КонецПериода) Тогда 
		Если Отчет.КонецПериода >= Отчет.НачалоПериода Тогда
			ТекстПериод = " " + НСтр("ru = 'за'")+ " ";
			ТекстПериод = ТекстПериод
				+ ПредставлениеПериода(НачалоДня(Отчет.НачалоПериода), КонецДня(Отчет.КонецПериода), "ФП = Истина");	
		Иначе
			ТекстПериод = "";
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		ТекстПериод = " " + НСтр("ru = 'за'")+ " "
			+ ПредставлениеПериода(НачалоДня(Отчет.НачалоПериода), КонецДня(Дата(3999, 11, 11)), "ФП = Истина");
		ТекстПериод = СтрЗаменить(ТекстПериод, Сред(ТекстПериод, СтрНайти(ТекстПериод, " - ")), " - ...");
	КонецЕсли;
	
	Форма.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Сверка документов с контрагентами (1С:Сверка 2.0)%1'"),
		ТекстПериод);
		
КонецПроцедуры

#КонецОбласти
